Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFH100.atdf
         <register caption="ADC9 Output Data Register" name="ADCDATA9" offset="0x224" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC10 Output Data Register" name="ADCDATA10" offset="0x228" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC11 Output Data Register" name="ADCDATA11" offset="0x22c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC12 Output Data Register" name="ADCDATA12" offset="0x230" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC13 Output Data Register" name="ADCDATA13" offset="0x234" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC14 Output Data Register" name="ADCDATA14" offset="0x238" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC15 Output Data Register" name="ADCDATA15" offset="0x23c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC16 Output Data Register" name="ADCDATA16" offset="0x240" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC17 Output Data Register" name="ADCDATA17" offset="0x244" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC18 Output Data Register" name="ADCDATA18" offset="0x248" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC19 Output Data Register" name="ADCDATA19" offset="0x24c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC20 Output Data Register" name="ADCDATA20" offset="0x250" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC21 Output Data Register" name="ADCDATA21" offset="0x254" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC22 Output Data Register" name="ADCDATA22" offset="0x258" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC23 Output Data Register" name="ADCDATA23" offset="0x25c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC24 Output Data Register" name="ADCDATA24" offset="0x260" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC25 Output Data Register" name="ADCDATA25" offset="0x264" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC26 Output Data Register" name="ADCDATA26" offset="0x268" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC27 Output Data Register" name="ADCDATA27" offset="0x26c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC28 Output Data Register" name="ADCDATA28" offset="0x270" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC29 Output Data Register" name="ADCDATA29" offset="0x274" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC30 Output Data Register" name="ADCDATA30" offset="0x278" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC31 Output Data Register" name="ADCDATA31" offset="0x27c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC32 Output Data Register" name="ADCDATA32" offset="0x280" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC33 Output Data Register" name="ADCDATA33" offset="0x284" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC34 Output Data Register" name="ADCDATA34" offset="0x288" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC43 Output Data Register" name="ADCDATA43" offset="0x2ac" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC44 Output Data Register" name="ADCDATA44" offset="0x2b0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
      </register-group>
      <value-group caption="Scan Trigger High Level/Positive Edge Sensitivity bit" name="ADCCON1__STRGLVL">
         <value caption="Scan trigger is high level sensitive. Once STRIG mode is selected (TRGSRCx in the ADCTRGx register)" name="" value="0x1"/>
         <value caption="Scan trigger is positive edge sensitive. Once STRIG mode is selected (TRGSRCx in the ADCTRGx register)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Vector Shift bits" name="ADCCON1__IRQVS">
         <value caption="Shift x left 7 bit position" name="" value="0x7"/>
         <value caption="Shift x left 6 bit position" name="" value="0x6"/>
         <value caption="Shift x left 5 bit position" name="" value="0x5"/>
         <value caption="Shift x left 4 bit position" name="" value="0x4"/>
         <value caption="Shift x left 3 bit position" name="" value="0x3"/>
         <value caption="Shift x left 2 bit position" name="" value="0x2"/>
         <value caption="Shift x left 1 bit position" name="" value="0x1"/>
         <value caption="Shift x left 0 bit position" name="" value="0x0"/>
      </value-group>
