Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFH100.atdf
      <value-group caption="Extended Identifier Enable bits" name="C2RXF5__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF5__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF6__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF6__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF6__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF6__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF6__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF6__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF7__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF7__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF7__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF7__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF7__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF7__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF8__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF8__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF8__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF8__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF8__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF8__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF9__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF9__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF9__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF9__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
