Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFH100.atdf
         <register caption="Change Notice control for PORTx Register" name="CNCONF" offset="0x570" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONF__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONF__ON"/>
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONG" offset="0x670" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONG__EDGEDETECT"/>
            <bitfield mask="0x00002000" name="SIDL"/>
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONG__ON"/>
         </register>
         <register caption="" name="CNENA" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENA0"/>
            <bitfield mask="0x00000002" name="CNENA1"/>
            <bitfield mask="0x00000004" name="CNENA2"/>
            <bitfield mask="0x00000008" name="CNENA3"/>
            <bitfield mask="0x00000010" name="CNENA4"/>
            <bitfield mask="0x00000020" name="CNENA5"/>
            <bitfield mask="0x00000040" name="CNENA6"/>
            <bitfield mask="0x00000080" name="CNENA7"/>
            <bitfield mask="0x00000100" name="CNENA8"/>
            <bitfield mask="0x00000200" name="CNENA9"/>
            <bitfield mask="0x00000400" name="CNENA10"/>
            <bitfield mask="0x00000800" name="CNENA11"/>
            <bitfield mask="0x00001000" name="CNENA12"/>
            <bitfield mask="0x00002000" name="CNENA13"/>
            <bitfield mask="0x00004000" name="CNENA14"/>
            <bitfield mask="0x00008000" name="CNENA15"/>
         </register>
         <register caption="" name="CNENB" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENB0"/>
            <bitfield mask="0x00000002" name="CNENB1"/>
            <bitfield mask="0x00000004" name="CNENB2"/>
            <bitfield mask="0x00000008" name="CNENB3"/>
            <bitfield mask="0x00000010" name="CNENB4"/>
            <bitfield mask="0x00000020" name="CNENB5"/>
            <bitfield mask="0x00000040" name="CNENB6"/>
            <bitfield mask="0x00000080" name="CNENB7"/>
            <bitfield mask="0x00000100" name="CNENB8"/>
            <bitfield mask="0x00000200" name="CNENB9"/>
            <bitfield mask="0x00000400" name="CNENB10"/>
            <bitfield mask="0x00000800" name="CNENB11"/>
            <bitfield mask="0x00001000" name="CNENB12"/>
            <bitfield mask="0x00002000" name="CNENB13"/>
            <bitfield mask="0x00004000" name="CNENB14"/>
            <bitfield mask="0x00008000" name="CNENB15"/>
         </register>
         <register caption="" name="CNENC" offset="0x280" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENC0"/>
            <bitfield mask="0x00000002" name="CNENC1"/>
            <bitfield mask="0x00000004" name="CNENC2"/>
            <bitfield mask="0x00000008" name="CNENC3"/>
            <bitfield mask="0x00000010" name="CNENC4"/>
            <bitfield mask="0x00000020" name="CNENC5"/>
            <bitfield mask="0x00000040" name="CNENC6"/>
            <bitfield mask="0x00000080" name="CNENC7"/>
            <bitfield mask="0x00000100" name="CNENC8"/>
            <bitfield mask="0x00000200" name="CNENC9"/>
            <bitfield mask="0x00000400" name="CNENC10"/>
            <bitfield mask="0x00000800" name="CNENC11"/>
            <bitfield mask="0x00001000" name="CNENC12"/>
            <bitfield mask="0x00002000" name="CNENC13"/>
            <bitfield mask="0x00004000" name="CNENC14"/>
            <bitfield mask="0x00008000" name="CNENC15"/>
         </register>
         <register caption="" name="CNEND" offset="0x380" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNEND0"/>
            <bitfield mask="0x00000002" name="CNEND1"/>
            <bitfield mask="0x00000004" name="CNEND2"/>
            <bitfield mask="0x00000008" name="CNEND3"/>
            <bitfield mask="0x00000010" name="CNEND4"/>
            <bitfield mask="0x00000020" name="CNEND5"/>
            <bitfield mask="0x00000040" name="CNEND6"/>
            <bitfield mask="0x00000080" name="CNEND7"/>
            <bitfield mask="0x00000100" name="CNEND8"/>
            <bitfield mask="0x00000200" name="CNEND9"/>
            <bitfield mask="0x00000400" name="CNEND10"/>
            <bitfield mask="0x00000800" name="CNEND11"/>
            <bitfield mask="0x00001000" name="CNEND12"/>
            <bitfield mask="0x00002000" name="CNEND13"/>
            <bitfield mask="0x00004000" name="CNEND14"/>
            <bitfield mask="0x00008000" name="CNEND15"/>
         </register>
         <register caption="" name="CNENE" offset="0x480" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENE0"/>
            <bitfield mask="0x00000002" name="CNENE1"/>
            <bitfield mask="0x00000004" name="CNENE2"/>
            <bitfield mask="0x00000008" name="CNENE3"/>
            <bitfield mask="0x00000010" name="CNENE4"/>
            <bitfield mask="0x00000020" name="CNENE5"/>
            <bitfield mask="0x00000040" name="CNENE6"/>
            <bitfield mask="0x00000080" name="CNENE7"/>
            <bitfield mask="0x00000100" name="CNENE8"/>
            <bitfield mask="0x00000200" name="CNENE9"/>
            <bitfield mask="0x00000400" name="CNENE10"/>
            <bitfield mask="0x00000800" name="CNENE11"/>
            <bitfield mask="0x00001000" name="CNENE12"/>
            <bitfield mask="0x00002000" name="CNENE13"/>
            <bitfield mask="0x00004000" name="CNENE14"/>
            <bitfield mask="0x00008000" name="CNENE15"/>
         </register>
         <register caption="" name="CNENF" offset="0x580" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENF0"/>
            <bitfield mask="0x00000002" name="CNENF1"/>
            <bitfield mask="0x00000004" name="CNENF2"/>
            <bitfield mask="0x00000008" name="CNENF3"/>
            <bitfield mask="0x00000010" name="CNENF4"/>
            <bitfield mask="0x00000020" name="CNENF5"/>
            <bitfield mask="0x00000040" name="CNENF6"/>
            <bitfield mask="0x00000080" name="CNENF7"/>
            <bitfield mask="0x00000100" name="CNENF8"/>
            <bitfield mask="0x00000200" name="CNENF9"/>
            <bitfield mask="0x00000400" name="CNENF10"/>
            <bitfield mask="0x00000800" name="CNENF11"/>
            <bitfield mask="0x00001000" name="CNENF12"/>
            <bitfield mask="0x00002000" name="CNENF13"/>
            <bitfield mask="0x00004000" name="CNENF14"/>
            <bitfield mask="0x00008000" name="CNENF15"/>
         </register>
         <register caption="" name="CNENG" offset="0x680" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENG0"/>
            <bitfield mask="0x00000002" name="CNENG1"/>
            <bitfield mask="0x00000004" name="CNENG2"/>
            <bitfield mask="0x00000008" name="CNENG3"/>
            <bitfield mask="0x00000010" name="CNENG4"/>
            <bitfield mask="0x00000020" name="CNENG5"/>
            <bitfield mask="0x00000040" name="CNENG6"/>
            <bitfield mask="0x00000080" name="CNENG7"/>
            <bitfield mask="0x00000100" name="CNENG8"/>
            <bitfield mask="0x00000200" name="CNENG9"/>
            <bitfield mask="0x00000400" name="CNENG10"/>
            <bitfield mask="0x00000800" name="CNENG11"/>
            <bitfield mask="0x00001000" name="CNENG12"/>
            <bitfield mask="0x00002000" name="CNENG13"/>
            <bitfield mask="0x00004000" name="CNENG14"/>
            <bitfield mask="0x00008000" name="CNENG15"/>
         </register>
         <register caption="" name="CNSTATA" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATA0"/>
            <bitfield mask="0x00000002" name="CNSTATA1"/>
            <bitfield mask="0x00000004" name="CNSTATA2"/>
            <bitfield mask="0x00000008" name="CNSTATA3"/>
            <bitfield mask="0x00000010" name="CNSTATA4"/>
            <bitfield mask="0x00000020" name="CNSTATA5"/>
            <bitfield mask="0x00000040" name="CNSTATA6"/>
            <bitfield mask="0x00000080" name="CNSTATA7"/>
            <bitfield mask="0x00000100" name="CNSTATA8"/>
            <bitfield mask="0x00000200" name="CNSTATA9"/>
            <bitfield mask="0x00000400" name="CNSTATA10"/>
            <bitfield mask="0x00000800" name="CNSTATA11"/>
            <bitfield mask="0x00001000" name="CNSTATA12"/>
            <bitfield mask="0x00002000" name="CNSTATA13"/>
            <bitfield mask="0x00004000" name="CNSTATA14"/>
            <bitfield mask="0x00008000" name="CNSTATA15"/>
         </register>
         <register caption="" name="CNSTATB" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATB0"/>
            <bitfield mask="0x00000002" name="CNSTATB1"/>
            <bitfield mask="0x00000004" name="CNSTATB2"/>
            <bitfield mask="0x00000008" name="CNSTATB3"/>
            <bitfield mask="0x00000010" name="CNSTATB4"/>
            <bitfield mask="0x00000020" name="CNSTATB5"/>
            <bitfield mask="0x00000040" name="CNSTATB6"/>
            <bitfield mask="0x00000080" name="CNSTATB7"/>
            <bitfield mask="0x00000100" name="CNSTATB8"/>
            <bitfield mask="0x00000200" name="CNSTATB9"/>
            <bitfield mask="0x00000400" name="CNSTATB10"/>
            <bitfield mask="0x00000800" name="CNSTATB11"/>
            <bitfield mask="0x00001000" name="CNSTATB12"/>
            <bitfield mask="0x00002000" name="CNSTATB13"/>
            <bitfield mask="0x00004000" name="CNSTATB14"/>
            <bitfield mask="0x00008000" name="CNSTATB15"/>
         </register>
         <register caption="" name="CNSTATC" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATC0"/>
            <bitfield mask="0x00000002" name="CNSTATC1"/>
            <bitfield mask="0x00000004" name="CNSTATC2"/>
            <bitfield mask="0x00000008" name="CNSTATC3"/>
            <bitfield mask="0x00000010" name="CNSTATC4"/>
            <bitfield mask="0x00000020" name="CNSTATC5"/>
            <bitfield mask="0x00000040" name="CNSTATC6"/>
            <bitfield mask="0x00000080" name="CNSTATC7"/>
            <bitfield mask="0x00000100" name="CNSTATC8"/>
            <bitfield mask="0x00000200" name="CNSTATC9"/>
            <bitfield mask="0x00000400" name="CNSTATC10"/>
            <bitfield mask="0x00000800" name="CNSTATC11"/>
            <bitfield mask="0x00001000" name="CNSTATC12"/>
            <bitfield mask="0x00002000" name="CNSTATC13"/>
            <bitfield mask="0x00004000" name="CNSTATC14"/>
            <bitfield mask="0x00008000" name="CNSTATC15"/>
         </register>
         <register caption="" name="CNSTATD" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATD0"/>
            <bitfield mask="0x00000002" name="CNSTATD1"/>
            <bitfield mask="0x00000004" name="CNSTATD2"/>
            <bitfield mask="0x00000008" name="CNSTATD3"/>
            <bitfield mask="0x00000010" name="CNSTATD4"/>
            <bitfield mask="0x00000020" name="CNSTATD5"/>
            <bitfield mask="0x00000040" name="CNSTATD6"/>
            <bitfield mask="0x00000080" name="CNSTATD7"/>
            <bitfield mask="0x00000100" name="CNSTATD8"/>
            <bitfield mask="0x00000200" name="CNSTATD9"/>
            <bitfield mask="0x00000400" name="CNSTATD10"/>
            <bitfield mask="0x00000800" name="CNSTATD11"/>
            <bitfield mask="0x00001000" name="CNSTATD12"/>
            <bitfield mask="0x00002000" name="CNSTATD13"/>
            <bitfield mask="0x00004000" name="CNSTATD14"/>
            <bitfield mask="0x00008000" name="CNSTATD15"/>
         </register>
         <register caption="" name="CNSTATE" offset="0x490" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATE0"/>
            <bitfield mask="0x00000002" name="CNSTATE1"/>
            <bitfield mask="0x00000004" name="CNSTATE2"/>
            <bitfield mask="0x00000008" name="CNSTATE3"/>
            <bitfield mask="0x00000010" name="CNSTATE4"/>
            <bitfield mask="0x00000020" name="CNSTATE5"/>
            <bitfield mask="0x00000040" name="CNSTATE6"/>
            <bitfield mask="0x00000080" name="CNSTATE7"/>
            <bitfield mask="0x00000100" name="CNSTATE8"/>
            <bitfield mask="0x00000200" name="CNSTATE9"/>
            <bitfield mask="0x00000400" name="CNSTATE10"/>
            <bitfield mask="0x00000800" name="CNSTATE11"/>
            <bitfield mask="0x00001000" name="CNSTATE12"/>
            <bitfield mask="0x00002000" name="CNSTATE13"/>
            <bitfield mask="0x00004000" name="CNSTATE14"/>
            <bitfield mask="0x00008000" name="CNSTATE15"/>
         </register>
